phaelbotelho/FsScape/my_i2c_pic18.c
/* 
 * File:   my_i2c_pic18.c
 * Author: raphael.pereira
 *
 * Created on December 4, 2023, 12:01 PM
 */

#include "main.h"

#include <xc.h>
#include <stdint.h>
#include <stdlib.h>
#include <stdio.h>

#include "my_clock.h"
#include "my_i2c_pic18.h"
#include "mcc_generated_files/mcc.h"
#include "mcc_generated_files/pin_manager.h"
#include "bitwise.h"

// Ported from: https://forum.microchip.com/s/topic/a5C3l000000MNpNEAW/t321653?comment=P-2424511

/** Private defines ***********************************************************/
#define Lo(x) ((x) & 0xff)
#define Hi(x) ((x) >> 8)

//-------------------Variables-------------------
uint16_t I2Cflags;
//-----------------------------------------------

//----------------Function Prototypes-------------------
void I2C_HWini(void);
void I2C_ModuleStart(uint32_t clock_output);
void I2C_ModuleStop();
void I2C_SWini(void);
int16_t I2C2_M_BusReset(void);
void I2C2_M_ClearErrors(void);
int16_t I2C2_M_Poll(uint8_t);
int16_t I2C2_M_Read(uint8_t, uint8_t, int16_t, char *);
int16_t I2C2_M_ReadByte(uint8_t);
int16_t I2C2_M_Read_Single(uint8_t DevAddr, uint8_t SubAddr, uint8_t *value);
int16_t I2C2_M_RecoverBus(void);
int16_t I2C2_M_Restart(void);
int16_t I2C2_M_Start(void);
int16_t I2C2_M_Stop(void);
int16_t I2C2_M_Write(uint8_t, uint8_t, int16_t, char *);
int16_t I2C2_M_Write24(uint8_t, uint8_t, int16_t, char *);
int16_t I2C2_M_WriteByte(char);
int16_t I2C2_M_Write_Single(uint8_t DevAddr, uint8_t SubAddr, uint8_t value);
void I2C2_M_ClearBus();

int16_t I2C_Mem_Write(uint8_t DevAddress, uint16_t MemAdress, uint16_t MemAddSize, uint8_t *pData, uint16_t Size, uint32_t Timeout);
int16_t I2C_Mem_Read(uint8_t DevAddress, uint16_t MemAdress, uint16_t MemAddSize, uint8_t *pData, uint16_t Size, uint32_t Timeout);
//------------------------------------------------------


void I2C_HWini(void)
{
    //-----Set pin drive modes-----
    //I2C - drive outputs so we can manually clear lines
    I2C1_SCL_TRIS = 1; //Start with bus in idle mode - both lines high
    I2C1_SDA_TRIS = 1;
}

void I2C_ModuleStart(uint32_t clock_output)
{
    SSP1STAT &= 0x3F; // Power on state
    SSP1CON2 = 0x00; // Power on state
    
    // Control slew rate according the speed.
    if(clock_output == 400000UL)
    {
        SSP1STAT |= 0b00000000; // Slew rate on.
    }
    else
    {
        SSP1STAT |= 0b10000000; // Slew rate off.
    }
    
    SSP1CON1 = 0b00001000; // Select serial mode.
    SSP1ADD = (uint8_t) ((uint32_t)CLOCK_PeripheralFrequencyGet() / (uint32_t)clock_output) - 1; // Clock = FOSC/(4 * (SSP1ADD + 1)) Therefore SSP1ADD = (FCY/FSCL) -1.
    
    SSP1CON1 |= 0b00100000; // Enable synchronous serial port
}

void I2C_ModuleStop()
{
    SSP1CON1bits.SSPEN = 0; // Disable the MSSP module.
}

void I2C_SWini(void)
{
    I2Cflags = 0;
    SetI2C2BusDirty; //I2C bus in unknown state, go ahead and clear it
}

//Reset the I2C bus - called by I2C2_M_RecoverBus()
//This routine will verify that SCL can be set HIGH, then free SDA by clocking until SDA goes HIGH.
//Then the bus will be reset by issuing a START and STOP condition to restart the I2C bus.
//This should clear any devices hung on incomplete I2C transfers.
//
//Note I2C module must not be active or this routine will not work
//Returns:
//I2C_OK
//I2C_Err_SCL_low
//I2C_Err_SDA_low
//*******************************************************************************
int16_t I2C2_M_BusReset()
{
    int16_t i;
    
    //Start with lines high - sets SCL high if not already there
    I2C1_SCL_SetDigitalInput();
    I2C1_SDA_SetDigitalInput();
    __delay_us(5); //Need 5uS delay
    
    if(I2C1_SCL_GetValue() == 0) //Read if line actually went high
    {
        return I2C_Err_SCL_low; //SCL stuck low - is the pullup resistor loaded?
    }
    //SCL ok, toggle until SDA goes high.
    i = 10;
    
    I2C1_SCL_SetDigitalOutput();
    while(i > 0)
    {
        if(I2C1_SDA_GetValue() == 1) //If SDA is high, then we are done
        {
            break;
        }
        I2C1_SCL_SetLow(); //SCL low
        __delay_us(1); //Need 5uS delay
        I2C1_SCL_SetHigh(); //SCL high
        __delay_us(1); //Need 5uS delay
        i--;
    }
    
    I2C1_SCL_SetDigitalInput();
    I2C1_SDA_SetDigitalInput();
    
    if(!I2C1_SDA_GetValue() && !I2C1_SCL_GetValue()) //We are ok if SCL and SDA high
    {
        return I2C_Err_SDA_low;
    }
    
    I2C1_SDA_SetDigitalOutput();
    I2C1_SDA_SetLow(); //SDA LOW while SCL HIGH -> START
    __delay_us(1); //Need 5uS delay
    I2C1_SDA_SetHigh(); //SDA HIGH while SCL HIGH -> STOP
    __delay_us(1); //Need 5uS delay
    I2C1_SCL_SetDigitalInput();
    I2C1_SDA_SetDigitalInput();
    return I2C_OK;
}

#if 0
int16_t I2C2_M_BusReset()
{
    int16_t i;

    //Start with lines high - sets SCL high if not already there
    //I2C2_SCL_GetValue(); LATFbits.LATF5 = 1;	//PORTFbits.RF5 = 1 is equivalent
    //I2C2_SDA_GetValue(); LATGbits.LATG3 = 1;
    I2C_SCL_SetDigitalOutput();
    I2C_SCL_SetLow();
    I2C_SDA_SetDigitalOutput();
    I2C_SDA_SetLow();

    __delay_us(5); //Need 5uS delay
    I2C_SCL_SetDigitalInput();
    I2C_SDA_SetDigitalInput();
    __delay_us(5); //Need 5uS delay
    
    if(I2C_SCL_GetValue() == 0) //Read if line actually went high
    {
        return I2C_Err_SCL_low; //SCL stuck low - is the pullup resistor loaded?
    }
    //SCL ok, toggle until SDA goes high.
    i = 10;
    
    I2C_SCL_SetDigitalOutput();
    while(i > 0)
    {
        if(I2C_SDA_GetValue() == 1) //If SDA is high, then we are done
        {
            break;
        }
        I2C_SCL_SetLow(); //SCL low
        __delay_us(1); //Need 5uS delay
        I2C_SCL_SetHigh(); //SCL high
        __delay_us(1); //Need 5uS delay
        i--;
    }
    
    I2C_SCL_SetDigitalInput();
    I2C_SDA_SetDigitalInput();
    
    if(!I2C_SDA_GetValue() && !I2C_SCL_GetValue()) //We are ok if SCL and SDA high
    {
        return I2C_Err_SDA_low;
    }
    
    I2C_SDA_SetDigitalOutput();
    //I2C_SCL_SetDigitalOutput();
    
    I2C_SDA_SetLow(); //SDA LOW while SCL HIGH -> START
    __delay_us(1); //Need 5uS delay
    I2C_SDA_SetHigh(); //SDA HIGH while SCL HIGH -> STOP
    __delay_us(1); //Need 5uS delay
    I2C_SCL_SetDigitalInput();
    I2C_SDA_SetDigitalInput();
    return I2C_OK;
}
#endif

//Clear any errors that may have occurred
void I2C2_M_ClearErrors()
{
    SSP1CON2bits.RCEN1 = 0; //Cancel receive request
    SSP1CON1bits.WCOL1 = 0; //Clear write-collision flag
    PIR2bits.BCL1IF = 0; //Clear bus-collision flag
}

//Poll an I2C device to see if it is alive
//This should be done periodically, say every 1 second
//Also does error recovery of the I2C bus here, if indicated
//Returns:
//I2C_OK
//I2C_Err_BadAddr
//I2C_Err_CommFail
//I2C_Err_Hardware

int16_t I2C2_M_Poll(uint8_t DevAddr)
{
    int retval;
    uint8_t SlaveAddr;

    SlaveAddr = DevAddr | 0;

    if(IsI2C2BusDirty)
    {
        I2C2_M_ClearErrors();
        if(I2C2_M_RecoverBus() == I2C_OK)
        {//Recovered
            ClrI2C2BusDirty;
        } else
        {
            return I2C_Err_Hardware;
        }
    }

    if(I2C2_M_Start() == I2C_OK)
    {
        retval = I2C2_M_WriteByte((char) SlaveAddr);
        if(I2C2_M_Stop() == I2C_OK) //Even if we have an error sending, try to close I2C
        {
            if(retval == I2C_ACK)
            {
                return I2C_OK;
            } else if(retval == I2C_Err_NAK)
            {
                return I2C_Err_BadAddr; //Check that correct device address is being used
            } else
            {
                return I2C_Err_CommFail;
            }

