phaelbotelho/FsScape/my_i2c_pic18.c
        }
    }
    //Get here then we had an error
    SetI2C2BusDirty; //Set error flag
    return I2C_Err_CommFail;
}

//High level function.  Reads data from target into buffer
//Returns:
//I2C_Ok
//I2C_Err_BadAddr
//I2C_Err_BusDirty
//I2C_Err_CommFail
int16_t I2C2_M_Read(uint8_t DevAddr, uint8_t SubAddr, int16_t uint8_tCnt, char *buffer)
{
    uint8_t SlaveAddr;
    int16_t retval;
    int16_t i;

    if(IsI2C2BusDirty) //Ignore requests until Poll cmd is called to fix err.
        return I2C_Err_BusDirty;

    if(I2C2_M_Start() != I2C_OK) //Start
    {//Failed to open bus
        SetI2C2BusDirty;
        return I2C_Err_CommFail;
    }

    SlaveAddr = DevAddr; //Device Address + Write bit
    retval = I2C2_M_WriteByte((char) SlaveAddr);
    if(retval == I2C_Err_NAK)
    {//Bad Slave Address or I2C slave device stopped responding
        I2C2_M_Stop();
        SetI2C2BusDirty; //Will reset slave device
        return I2C_Err_BadAddr;
    } else if(retval < 0)
    {
        I2C2_M_Stop();
        SetI2C2BusDirty;
        return I2C_Err_CommFail;
    }

    if(I2C2_M_WriteByte((char) SubAddr) != I2C_OK) //Sub Addr
    {
        I2C2_M_Stop();
        SetI2C2BusDirty;
        return I2C_Err_CommFail;
    }

    if(I2C2_M_Restart() != I2C_OK) //Repeated start - switch to read mode
    {
        I2C2_M_Stop();
        SetI2C2BusDirty;
        return I2C_Err_CommFail;
    }

    SlaveAddr = DevAddr + 1; //Device Address + Read bit
    if(I2C2_M_WriteByte((char) SlaveAddr) != I2C_OK) //Slave Addr
    {
        I2C2_M_Stop();
        SetI2C2BusDirty;
        return I2C_Err_CommFail;
    }
    for(i = 0; i < uint8_tCnt; i++) //Data
    {
        if(i == (uint8_tCnt - 1))
        {
            retval = I2C2_M_ReadByte(I2C_M_NACK); //NACK on last uint8_t so slave knows this is it
        } else
        {
            retval = I2C2_M_ReadByte(I2C_M_ACK);
        }
        if(retval >= 0)
        {
            //buffer[i] = retval;
        } else
        {//Error while reading uint8_t.  Close connection and set error flag.
            I2C2_M_Stop();
            SetI2C2BusDirty;
            return I2C_Err_CommFail;
        }
    }

    if(I2C2_M_Stop() != I2C_OK)
    {//Failed to close bus
        SetI2C2BusDirty;
        return I2C_Err_CommFail;
    }
    return I2C_OK; //Success
}

//Initiates read of one uint8_t from slave on I2C bus
//Slave must already be addressed, and in read mode
//Waits until completed before returning
//*Caution* Slave can cause a timeout by clock stretching too long
//Returns:
//0x0000-0x00FF Read value stored in low uint8_t (returned integer will always be positive)
//  Error status is indicated by negative return values
//I2C_Err_Overflow
//I2C_Err_RcvTimeout (will happen if slave is clock stretching, or SCL suddenly shorted to ground)
//I2C_Err_SCL_stucklow.  SDA stuck low cannot be detected here.

int16_t I2C2_M_ReadByte(uint8_t ACKflag)
{
    int16_t t;

    if(ACKflag == I2C_M_NACK) //Set state in preparation for TX below
    {
        SSP1CON2bits.ACKDT1 = 1; //NACK
    } else
    {
        SSP1CON2bits.ACKDT1 = 0; //ACK
    }

    SSP1CON2bits.RCEN1 = 1; //Start receive
    t = 0; //Timeout is processor speed dependent.  @(4*8Mhz=16MIPS) and 8 bits, I expect <=320.
    //We could wait for RCEN to be cleared, but are really interested in incoming uint8_t, so look for I2C2STAT.RBF
    while(!SSP1STATbits.BF1) //HW cleared when receive complete
    {
        t++;
        if(t > 8000)
        {//SCL stuck low
            //RCEN cannot be cleared in SW. Will need to reset I2C interface, or wait until SCL goes high.
            return I2C_Err_RcvTimeout;
        }
    }//Tested: t=30
    //I2C2STATbits.RBF will likely be set

    //As the master we must ACK or NACK every uint8_t, so slave knows if it will send another uint8_t.
    //We have set the bit above, just need to send it
    SSP1CON2bits.ACKEN1 = 1; //Send ACK bit now
    t = 0; //Timeout is processor speed dependent.  @(4*8Mhz=16MIPS), I expect <=40.
    while(SSP1CON2bits.ACKEN1) //HW cleared when complete
    {
        t++;
        if(t > 1000)
        {//This will timeout if SCL stuck low
            //ACKEN cannot be cleared in SW. I2C interface must be reset after this error.
            return I2C_Err_SCL_low;
        }
    }//Tested: t=4
    if(SSP1CON1bits.SSPOV1) //If an overflow occurred, it means we received a new uint8_t before reading last one
    {
        SSP1CON1bits.SSPOV1 = 0;
        return I2C_Err_Overflow;
    }

    return SSP1BUF; //Reading this register clears RBF
}

//High level function.  Reads single byte from target into buffer
//Returns:
//I2C_Ok
//I2C_Err_BadAddr
//I2C_Err_BusDirty
//I2C_Err_CommFail
int16_t I2C2_M_Read_Single(uint8_t DevAddr, uint8_t SubAddr, uint8_t *value)
{
    uint8_t SlaveAddr;
    volatile int16_t retval;

    I2C2_M_Start(); //Start

    retval = I2C2_M_WriteByte((char) DevAddr);

    if(retval == I2C_Err_NAK)
    {//Bad Slave Address or I2C slave device stopped responding
        I2C2_M_Stop();
        SetI2C2BusDirty; //Will reset slave device
        return I2C_Err_BadAddr;
    }
    else if(retval < 0)
    {
        I2C2_M_Stop();
        SetI2C2BusDirty;
        return I2C_Err_CommFail;
    }

    if(I2C2_M_WriteByte((char) SubAddr) != I2C_OK) //Sub Addr
    {
        I2C2_M_Stop();
        SetI2C2BusDirty;
        return I2C_Err_CommFail;
    }

    if(I2C2_M_Restart() != I2C_OK) //Repeated start - switch to read mode
    {
        I2C2_M_Stop();
        SetI2C2BusDirty;
        return I2C_Err_CommFail;
    }

    SlaveAddr = DevAddr + 0x01; //Device Address + Read bit
    if(I2C2_M_WriteByte((char) SlaveAddr) != I2C_OK) //Slave Addr
    {
        I2C2_M_Stop();
        SetI2C2BusDirty;
        return I2C_Err_CommFail;
    }
    
    retval = I2C2_M_ReadByte(I2C_M_NACK); //NACK on last byte so slave knows this is it
    
    if(retval >= 0)
    {
        *value = retval;
    }
    else
    {//Error while reading byte.  Close connection and set error flag.
        I2C2_M_Stop();
        SetI2C2BusDirty;
        return I2C_Err_CommFail;
    }

