phaelbotelho/FsScape/my_i2c_pic18.c
    if(I2C2_M_Stop() != I2C_OK)
    {//Failed to close bus
        SetI2C2BusDirty;
        return I2C_Err_CommFail;
    }

    return I2C_OK; //Success
}

//Attempt to recover after I2C error
//Returns:
//I2C_OK
//I2C_Err_Hardware
int16_t I2C2_M_RecoverBus()
{
    int16_t status;
    //	//Level 1: reset the I2C hardware on our side
    //	I2C2CONbits.I2CEN = 0;
    //	Nop();
    //	I2C2CONbits.I2CEN = 1;

    //Level 2: reset devices on I2C network
    //Disable I2C so we can toggle pins
    SSP1CON1bits.SSPEN1 = 0;
    status = I2C2_M_BusReset();
    if(status > 0)
    {//Fatal I2C error, nothing we can do about it
        return I2C_Err_Hardware;
    }
    //That worked, bring I2C back online
    SSP1CON1bits.SSPEN1 = 1;

    return I2C_OK;
}

//Initiates repeated start sequence on I2C bus
//Waits until completed before returning
//Returns:
//I2C_OK
//I2C_Err_BCL
//I2C_Err_SCL_low.  SDA stuck low cannot be detected here.
int16_t I2C2_M_Restart()
{
    int16_t t;

    SSP1CON2bits.RSEN1 = 1; //Initiate restart condition
    t = 0; //Timeout is processor speed dependent.  @(4*8Mhz=32Mhz;16MIPS), I expect <=40.
    while(SSP1CON2bits.RSEN1) //HW cleared when complete
    {
        t++;
        if(t > 1000)
        {//Will timeout if SCL stuck low
            //RSEN cannot be cleared in SW. Will need to reset I2C interface.
            return I2C_Err_SCL_low;
        }
    }//Tested: t=5

    if(PIR2bits.BCL1IF)
    {//SDA stuck low
        PIR2bits.BCL1IF = 0; //Clear error to regain control of I2C
        return I2C_Err_BCL;
    }

    return I2C_OK;
}

//Initiates start sequence on I2C bus
//Waits until completed before returning
//Returns:
//I2C_OK
//I2C_Err_BCL
//I2C_Err_IWCOL
//I2C_Err_TimeoutHW
int16_t I2C2_M_Start()
{
    int16_t t;

    SSP1CON2bits.SEN1 = 1; //Initiate Start condition
    Nop();
    if(PIR2bits.BCL1IF)
    {//SCL or SDA stuck low
        SSP1CON2bits.SEN1 = 0; //Cancel request (will still be set if we had previous BCL)
        PIR2bits.BCL1IF = 0; //Clear error to regain control of I2C
        return I2C_Err_BCL;
    }
    if(SSP1CON1bits.WCOL1)
    {//Not sure how this happens but it occurred once, so trap here
        SSP1CON2bits.SEN1 = 0; //Clear just in case set
        SSP1CON1bits.WCOL1 = 0; //Clear error
        return I2C_Err_IWCOL;
    }

    t = 0; //Timeout is processor speed dependent.  @(4*8Mhz=32Mhz;16MIPS), I expect <=40.
    while(SSP1CON2bits.SEN1) //HW cleared when complete
    {
        t++;
        if(t > 1000)
        {//Since SCL and SDA errors are trapped by BCL error above, this should never happen
            return I2C_Err_TimeoutHW;
        }
    }//Tested: t=3.  I2C2STATbits.S will be set indicating start bit detected.

    //If a second start request is issued after first one, the I2C module will instead:
    //generate a stop request, clear SEN, and flag BCL.  Test for BCL here.
    if(PIR2bits.BCL1IF)
    {
        PIR2bits.BCL1IF = 0; //Clear error to regain control of I2C
        return I2C_Err_BCL;
    }

    return I2C_OK;
}

//Initiates stop sequence on I2C bus
//Waits until completed before returning
//Returns:
//I2C_OK
//I2C_Err_BCL
//I2C_Err_SCL_low.  SDA stuck low cannot be detected here.
int16_t I2C2_M_Stop()
{
    int16_t t;

    SSP1CON2bits.PEN1 = 1; //Initiate stop condition
    Nop();
    if(PIR2bits.BCL1IF)
    {//Not sure if this can ever happen here
        PIR2bits.BCL1IF = 0; //Clear error
        return I2C_Err_BCL; //Will need to reset I2C interface.
    }

    t = 0; //Timeout is processor speed dependent.  @(4*8Mhz=16MIPS), I expect <=40.
    while(SSP1CON2bits.PEN1) //HW cleared when complete
    {
        t++;
        if(t > 1000)
        {//Will timeout if SCL stuck low
            //PEN cannot be cleared in SW. Will need to reset I2C interface.
            return I2C_Err_SCL_low;
        }
    }//Tested: t=5
    return I2C_OK;
}

//High level function.  Writes buffered data to target address.
//Returns:
//I2C_OK
//I2C_Err_BadAddr
//I2C_Err_BusDirty
//I2C_Err_CommFail
int16_t I2C2_M_Write(uint8_t DevAddr, uint8_t SubAddr, int16_t uint8_tCnt, char *buffer)
{
    int16_t i;
    int16_t retval;
    uint8_t SlaveAddr;

    if(IsI2C2BusDirty) //Ignore requests until Poll cmd is called to fix err.
    {
        printf("i2c dirty on first check\n");
        return I2C_Err_BusDirty;
    }

    if(I2C2_M_Start() != 0) //Start
    {//Failed to open bus
        SetI2C2BusDirty;
        return I2C_Err_CommFail;
    }

    SlaveAddr = DevAddr | 0; //Device Address + Write bit
    retval = I2C2_M_WriteByte((char) SlaveAddr);
    if(retval == I2C_Err_NAK)
    {//Bad Slave Address or I2C slave device stopped responding
        I2C2_M_Stop();
        SetI2C2BusDirty; //Will reset slave device
        return I2C_Err_BadAddr;
    } else if(retval < 0)
    {
        I2C2_M_Stop();
        SetI2C2BusDirty;
        return I2C_Err_CommFail;
    }

    if(I2C2_M_WriteByte((char) SubAddr) != I2C_ACK) //Sub Addr
    {
        I2C2_M_Stop();
        SetI2C2BusDirty;
        return I2C_Err_CommFail;
    }

    for(i = 0; i < uint8_tCnt; i++) //Data
    {
        if(I2C2_M_WriteByte(buffer[i]) != I2C_ACK)
        {//Error while writing uint8_t.  Close connection and set error flag.
            I2C2_M_Stop();
            SetI2C2BusDirty;
            return I2C_Err_CommFail;
        }
    }

    if(I2C2_M_Stop() != I2C_OK)
    {//Failed to close bus
        SetI2C2BusDirty;
        return I2C_Err_CommFail;
    }
    return I2C_OK;
}

//High level function.  Writes buffered data to target address.
//Returns:
//I2C_OK
//I2C_Err_BadAddr
//I2C_Err_BusDirty
//I2C_Err_CommFail
int16_t I2C2_M_Write24(uint8_t DevAddr, uint8_t SubAddr, int16_t uint8_tCnt, char *buffer)
{
    int16_t i;
    int16_t retval;
    uint8_t SlaveAddr;

    if(IsI2C2BusDirty) //Ignore requests until Poll cmd is called to fix err.
        return I2C_Err_BusDirty;

    if(I2C2_M_Start() != 0) //Start
    {//Failed to open bus
        SetI2C2BusDirty;
        return I2C_Err_CommFail;
    }

    SlaveAddr = DevAddr | 0; //Device Address + Write bit
    retval = I2C2_M_WriteByte((char) SlaveAddr);
    if(retval == I2C_Err_NAK)
    {//Bad Slave Address or I2C slave device stopped responding
        I2C2_M_Stop();
        SetI2C2BusDirty; //Will reset slave device
        return I2C_Err_BadAddr;
    }
    else if(retval < 0)
    {
        I2C2_M_Stop();
        SetI2C2BusDirty;
        return I2C_Err_CommFail;
    }

    if(I2C2_M_WriteByte((char) SubAddr) != I2C_ACK) //Sub Addr
    {
        I2C2_M_Stop();
        SetI2C2BusDirty;
        return I2C_Err_CommFail;
    }

    for(i = 0; i < uint8_tCnt; i++) //Data
    {
        if(I2C2_M_WriteByte(buffer[i]) != I2C_ACK)
        {//Error while writing uint8_t.  Close connection and set error flag.
            I2C2_M_Stop();
            SetI2C2BusDirty;
            return I2C_Err_CommFail;
        }
    }

