phaelbotelho/FsScape/my_i2c_pic18.c
    if(I2C2_M_Stop() != I2C_OK)
    {//Failed to close bus
        SetI2C2BusDirty;
        return I2C_Err_CommFail;
    }
    return I2C_OK;
}

//Sends a uint8_t to a slave
//Waits until completed before returning
//Returns:
//I2C_ACK
//I2C_Err_BCL
//I2C_Err_NAK
//I2C_Err_SCL_low
//I2C_Err_TBF
int16_t I2C2_M_WriteByte(char cData)
{
    int16_t t;

    if(SSP1STATbits.R_NOT_W) //Is there already a uint8_t waiting to send?
    {
        return I2C_Err_TBF;
    }

    SSP1BUF = cData; //Send uint8_t
    //Transmission takes several clock cycles to complete.  As a result we won't see BCL error for a while.
    t = 0; //Timeout is processor speed dependent.  @(4*8Mhz=32Mhz;16MIPS) and 8 bits, I expect <=320.

    while(SSP1STATbits.BF1) //HW cleared when TX complete
    {
        t++;

        if(t > 16000)
        {//This is bad because TRSTAT will still be set
            return I2C_Err_SCL_low; //Must reset I2C interface, and possibly slave devices
        }
    }//Testing: t=31

    if(PIR2bits.BCL1IF)
    {
        PIR2bits.BCL1IF = 0; //Clear error to regain control of I2C
        return I2C_Err_BCL;
    }

    //Done, now how did slave respond?
    if(SSP1CON2bits.ACKSTAT1) //1=NACK
        return I2C_Err_NAK; //  NACK
    else
        return I2C_ACK; //  ACK
}

//High level function.  Writes single byte data to target address.
//Returns:
//I2C_OK
//I2C_Err_BadAddr
//I2C_Err_BusDirty
//I2C_Err_CommFail
int16_t I2C2_M_Write_Single(uint8_t DevAddr, uint8_t SubAddr, uint8_t value)
{
    int16_t retval;
    uint8_t SlaveAddr;

    if(IsI2C2BusDirty) //Ignore requests until Poll cmd is called to fix err.
        return I2C_Err_BusDirty;

    if(I2C2_M_Start() != 0) //Start
    {
        //Failed to open bus
        SetI2C2BusDirty;
        return I2C_Err_CommFail;
    }

    SlaveAddr = DevAddr; //Device Address + Write bit
    retval = I2C2_M_WriteByte((char) SlaveAddr);
    if(retval == I2C_Err_NAK)
    {
        //Bad Slave Address or I2C slave device stopped responding
        I2C2_M_Stop();
        SetI2C2BusDirty; //Will reset slave device
        return I2C_Err_BadAddr;
    }
    else if(retval < 0)
    {
        I2C2_M_Stop();
        SetI2C2BusDirty;
        return I2C_Err_CommFail;
    }

    if(I2C2_M_WriteByte((char) SubAddr) != I2C_ACK) //Sub Addr
    {
        I2C2_M_Stop();
        SetI2C2BusDirty;
        return I2C_Err_CommFail;
    }

    if(I2C2_M_WriteByte(value) != I2C_ACK)
    {
        //Error while writing byte.  Close connection and set error flag.
        I2C2_M_Stop();
        SetI2C2BusDirty;
        return I2C_Err_CommFail;
    }
    
    if(I2C2_M_Stop() != I2C_OK)
    {
        //Failed to close bus
        SetI2C2BusDirty;
        return I2C_Err_CommFail;
    }

    return I2C_OK;
}

void I2C2_M_ClearBus()
{
    uint8_t i;
    
    for(i = 0; i < 8; i++)
    {
        I2C1_SCL_SetDigitalOutput();
        I2C1_SCL_SetDigitalInput();
    }
}

int16_t I2C_Mem_Write(uint8_t DevAddress, uint16_t MemAdress, uint16_t MemAddSize, uint8_t *pData, uint16_t Size, uint32_t Timeout)
{
    //uint32_t _old_millis = millis();
    int16_t i;
    int16_t retval;
    uint8_t SlaveAddr;

    if(IsI2C2BusDirty) //Ignore requests until Poll cmd is called to fix err.
        return I2C_Err_BusDirty;

    if(I2C2_M_Start() != 0) //Start
    {//Failed to open bus
        SetI2C2BusDirty;
        return I2C_Err_CommFail;
    }

    SlaveAddr = DevAddress | 0; //Device Address + Write bit
    retval = I2C2_M_WriteByte((char) SlaveAddr);
    if(retval == I2C_Err_NAK)
    {//Bad Slave Address or I2C slave device stopped responding
        I2C2_M_Stop();
        SetI2C2BusDirty; //Will reset slave device
        return I2C_Err_BadAddr;
    } else if(retval < 0)
    {
        I2C2_M_Stop();
        SetI2C2BusDirty;
        return I2C_Err_CommFail;
    }

    if(I2C2_M_WriteByte((char) Hi(MemAdress)) != I2C_ACK) //MemAdress High parcel.
    {
        I2C2_M_Stop();
        SetI2C2BusDirty;
        return I2C_Err_CommFail;
    }
    if(I2C2_M_WriteByte((char) Lo(MemAdress)) != I2C_ACK) //MemAdress Low parcel.
    {
        I2C2_M_Stop();
        SetI2C2BusDirty;
        return I2C_Err_CommFail;
    }

    for(i = 0; i < Size; i++) //Data
    {
        if(I2C2_M_WriteByte(pData[i]) != I2C_ACK)
        {//Error while writing uint8_t.  Close connection and set error flag.
            I2C2_M_Stop();
            SetI2C2BusDirty;
            return I2C_Err_CommFail;
        }
    }

    if(I2C2_M_Stop() != I2C_OK)
    {//Failed to close bus
        SetI2C2BusDirty;
        return I2C_Err_CommFail;
    }
    return I2C_OK;
}

int16_t I2C_Mem_Read(uint8_t DevAddress, uint16_t MemAdress, uint16_t MemAddSize, uint8_t *pData, uint16_t Size, uint32_t Timeout)
{
    //uint32_t old_millis = millis();
    uint8_t SlaveAddr;
    int16_t retval;
    int16_t i;

    if(IsI2C2BusDirty) //Ignore requests until Poll cmd is called to fix err.
        return I2C_Err_BusDirty;

    if(I2C2_M_Start() != I2C_OK) //Start
    {//Failed to open bus
        SetI2C2BusDirty;
        return I2C_Err_CommFail;
    }

    SlaveAddr = DevAddress; //Device Address + Write bit
    retval = I2C2_M_WriteByte((char) SlaveAddr);
    if(retval == I2C_Err_NAK)
    {//Bad Slave Address or I2C slave device stopped responding
        I2C2_M_Stop();
        SetI2C2BusDirty; //Will reset slave device
        return I2C_Err_BadAddr;
    } else if(retval < 0)
    {
        I2C2_M_Stop();
        SetI2C2BusDirty;
        return I2C_Err_CommFail;
    }

    if(I2C2_M_WriteByte((char) Hi(MemAdress)) != I2C_OK) //MemAdress High parcel.
    {
        I2C2_M_Stop();
        SetI2C2BusDirty;
        return I2C_Err_CommFail;
    }
    if(I2C2_M_WriteByte((char) Lo(MemAdress)) != I2C_OK) //MemAdress Low parcel.
    {
        I2C2_M_Stop();
        SetI2C2BusDirty;
        return I2C_Err_CommFail;
    }

    if(I2C2_M_Restart() != I2C_OK) //Repeated start - switch to read mode
    {
        I2C2_M_Stop();
        SetI2C2BusDirty;
        return I2C_Err_CommFail;
    }

    SlaveAddr = DevAddress + 1; //Device Address + Read bit
    if(I2C2_M_WriteByte((char) SlaveAddr) != I2C_OK) //Slave Addr
    {
        I2C2_M_Stop();
        SetI2C2BusDirty;
        return I2C_Err_CommFail;
    }
    for(i = 0; i < Size; i++) //Data
    {
        if(i == (Size - 1))
        {
            retval = I2C2_M_ReadByte(I2C_M_NACK); //NACK on last uint8_t so slave knows this is it
        } else
        {
            retval = I2C2_M_ReadByte(I2C_M_ACK);
        }
        if(retval >= 0)
        {
            pData[i] = (uint8_t)retval;
        } else
        {//Error while reading uint8_t.  Close connection and set error flag.
            I2C2_M_Stop();
            SetI2C2BusDirty;
            return I2C_Err_CommFail;
        }
    }

    if(I2C2_M_Stop() != I2C_OK)
    {//Failed to close bus
        SetI2C2BusDirty;
        return I2C_Err_CommFail;
    }
    return I2C_OK; //Success
}

